app/views/addresses/index.html.slim


  - @entry.addresses.each do |address|
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."entry_id" = 5