app/controllers/addresses_controller.rb

SELECT "addresses".* FROM "addresses" WHERE "addresses"."entry_id" = 5
---
  def index
    respond_with(@address=@entry.addresses.all)

SELECT "addresses".* FROM "addresses" WHERE "addresses"."entry_id" = 5 AND "addresses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @addresses = @entry.addresses.find(params[:id])

SELECT "addresses".* FROM "addresses" WHERE "addresses"."entry_id" = 5 AND "addresses"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @address = @entry.addresses.find(params[:id])

INSERT INTO "addresses" ("city", "created_at", "entry_id", "state", "street", "updated_at", "zip") VALUES (?, ?, ?, ?, ?, ?, ?)  [["city", "yo city"], ["created_at", Fri, 15 Feb 2013 17:55:35 UTC +00:00], ["entry_id", 5], ["state", "NY"], ["street", "yo"], ["updated_at", Fri, 15 Feb 2013 17:55:35 UTC +00:00], ["zip", 10222]]
---
  def create
    @address = @entry.addresses.new(params[:address])
    flash[:notice] = "Address created" if @address.save

SELECT "addresses".* FROM "addresses" WHERE "addresses"."entry_id" = 7 AND "addresses"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "addresses" SET "street" = 'frcv lab1', "updated_at" = '2013-02-15 19:34:45.379570' WHERE "addresses"."id" = 1
---
  def update
     @address = @entry.addresses.find(params[:id])
    respond_to do |format|
      if @address.update_attributes(params[:address])

SELECT "addresses".* FROM "addresses" WHERE "addresses"."entry_id" = 5 AND "addresses"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "addresses" WHERE "addresses"."id" = ?  [["id", 1]]
---
  def destroy
    @address = @entry.addresses.find(params[:id])
    @address.destroy