app/controllers/entries_controller.rb

SELECT "entries".* FROM "entries"
---
  def index
   respond_with (@entries = Entry.all)

SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @entry = Entry.find(params[:id])

INSERT INTO "entries" ("created_at", "email", "first_name", "last_name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", Wed, 06 Feb 2013 23:31:53 UTC +00:00], ["email", "test@entry.com"], ["first_name", "Test"], ["last_name", "Entry"], ["updated_at", Wed, 06 Feb 2013 23:31:53 UTC +00:00]]
---
  def create
    @entry = Entry.new(params[:entry])
    flash[:notice] = "Entry created" if @entry.save

SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "entries" SET "updated_at" = '2013-02-07 07:19:41.242224', "email" = 'p@p.co' WHERE "entries"."id" = 2
---
  def update
    @entry = Entry.find(params[:id])
    respond_to do |format|
      if @entry.update_attributes(params[:entry])

SELECT "entries".* FROM "entries" WHERE "entries"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "entries" WHERE "entries"."id" = ?  [["id", 1]]
---
  def destroy
    @entry = Entry.find(params[:id])
    @entry.destroy